docs/site/20210820160500-winkler98_interaction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-29 Wed 22:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>winkler98_interaction</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">winkler98_interaction</h1>
<p>
Interactive music is defined as a music composition or improvisation where software interprets a live performance to affect music generated or modified by computers.
</p>

<p>
For a piece to be interactive, Winkler describes a five step process. First, there must be human input of some kind. Then, a computer has to receive the input and analyze it in some way. Then the computer interprets what it has received. Fourth, the computer then processes something. Finally, the computer outputs sound.
</p>

<p>
This interaction between human and computer lets a computer take on some aspects of human musicality, and also lets a human overcome the physical limitations of their instrument.
</p>

<p>
Interaction in music is disappearing. Recordings have taken away the interaction between the performer and the audience. Pop musicians will sometimes lip sing to appear as close as possible to the recording. Computer music initially started without interaction, as computers were not powerful enough for live performance. But many audience members felt the absence of a visual component to music. Mixing live performers with the computer music brought this back, but then the performer struggled with not being able to interact with the music. So experiments began to give more interaction to computer music.
</p>

<p>
Part of the appeal of interactive computer music is the drama of who is in charge of the interactions. Is it the computer or the performer? This is largely determined by the composer.
</p>

<p>
<a href="winkler98_compos_inter_music">winkler98_compos_inter_music</a>
</p>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
